In [ ]:
'''
question
we have a employeee database
name,age ,salary,department,designation
1 Load this data
2 Print record of each department individually and show the count.
3 Print sorted data on salary in ascending order
4 Print each department total salary.
5 Print second highest salary getter employee name
'''

In [2]:
import pandas as pd
import numpy as np

In [4]:
file = pd.read_csv("ass2.csv")
file.head()
print(file)
file.count()
print(file)
file.sort_values("Salary",axis=0)
print(file)

     Name  Age  Salary  Department     Designation
0   Kamal   23   50000          IT         Manager
1  Rashmi   24   70000     Defence      Lieutanant
2  Shivam   23   40000  Management  Senior Manager
3  Aditya   24   80000     Defence           Major
     Name  Age  Salary  Department     Designation
0   Kamal   23   50000          IT         Manager
1  Rashmi   24   70000     Defence      Lieutanant
2  Shivam   23   40000  Management  Senior Manager
3  Aditya   24   80000     Defence           Major
     Name  Age  Salary  Department     Designation
0   Kamal   23   50000          IT         Manager
1  Rashmi   24   70000     Defence      Lieutanant
2  Shivam   23   40000  Management  Senior Manager
3  Aditya   24   80000     Defence           Major

In [3]:
file

     Name  Age  Salary  Department     Designation
0   Kamal   23   50000          IT         Manager
1  Rashmi   24   70000     Defence      Lieutanant
2  Shivam   23   40000  Management  Senior Manager
3  Aditya   24   80000     Defence           Major

In [15]:
file.sort_values(by='Salary')

     Name  Age  Salary  Department     Designation
2  Shivam   23   40000  Management  Senior Manager
0   Kamal   23   50000          IT         Manager
1  Rashmi   24   70000     Defence      Lieutanant
3  Aditya   24   80000     Defence           Major

In [6]:
file.groupby('Department').sum()

            Age  Salary
Department
Defence      48  150000
IT           23   50000
Management   23   40000

In [7]:
file1 = file[['Name','Salary']]
file1

     Name  Salary
0   Kamal   50000
1  Rashmi   70000
2  Shivam   40000
3  Aditya   80000

In [8]:
file2 = file1.sort_values('Salary',ascending = False)
print(file2.iloc[1])

Name      Rashmi
Salary     70000
Name: 1, dtype: object